# Параметры

SELF_MINT_COUNT = [350, 500]  # диапазон минтов на один адресс

# Время ожидания между минтами одного аккаунта
NEXT_MINT_MIN_WAIT_TIME = 10   # В секундах
NEXT_MINT_MAX_WAIT_TIME = 16  # В секундах

# Время ожидания между регистрацией акков рандомное в указанном диапазоне
NEXT_ADDRESS_MIN_WAIT_TIME = 0.5  # В минутах
NEXT_ADDRESS_MAX_WAIT_TIME = 1  # В минутах

# максимальное количество попыток подключить кошелек
MAX_TRIES_FOR_ADDRESS = 5

# максимальное количество попыток заминтить
MAX_TRIES_FOR_MINT = 5

